package com.javarush.test.level04.lesson13.task04;

import java.io.BufferedReader;
import java.io.InputStreamReader;

/* Рисуем линии
Используя цикл for вывести на экран:
- горизонтальную линию из 10 восьмёрок
- вертикальную линию из 10 восьмёрок.
*/

public class Solution
{
    public static void main(String[] args) throws Exception
    {

        int i,j;
        for(i=1; i<11; i++)
        {
            System.out.print("8");
        }
            System.out.println();
        for(j=1; j<11; j++)
            {
                System.out.println("8");
            }

        //Напишите тут ваш код

    }
}
